#ifndef ERRORCODE_H
#define ERRORCODE_H

#define EC_100000 "100000"  // 系统
#define EC_200000 "200000"  // 用户
#define EC_210000 "210000"  // 用户登录
#define EC_211000 "211000"  // 用户登录用户密码
#define EC_211100 "211100"  // 用户登录用户密码名称
#define EC_211200 "211200"  // 用户登录用户密码密码
#define EC_212000 "212000"  // 用户登录邮箱
#define EC_212100 "212100"  // 用户登录邮箱地址非法
#define EC_220000 "220000"  // 用户上传
#define EC_221000 "221000"  // 用户上传文件
#define EC_221100 "221100"  // 超过1g不能上传
#define EC_300000 "300000"  // 供应商
#define EC_330000 "330000"  // 供应商腾讯云
#define EC_331000 "331000"  // 供应商腾讯云桶
#define EC_331100 "331100"  // 供应商腾讯云桶创建
#define EC_331200 "331200"  // 供应商腾讯云桶查询
#define EC_331300 "331300"  // 供应商腾讯云桶删除
#define EC_332000 "332000"  // 供应商腾讯云对象
#define EC_332100 "332100"  // 供应商腾讯云对象创建
#define EC_332200 "332200"  // 供应商腾讯云对象查询
#define EC_332300 "332300"  // 供应商腾讯云对象删除
#define EC_332400 "332400"  // 供应商腾讯云对象上传
#define EC_332500 "332500"  // 供应商腾讯云对象下载

#endif // ERRORCODE_H
